from flask import Flask, render_template, jsonify
import random

app = Flask(__name__)

messages = [
    "Ти моє сонечко 🌞",
    "Тебе обіймає маленька коала 💖",
    "У тебе класні ямки на щічках 😊",
    "Ти мій дім 🥰",
    "Ти дуже сексі 💭💕",
    "Люблю тебе дуже сильно і моя любов, як промінчики сонечка🌞",
    "Пишаюся тобою 💖",
    "Цілую твої щічки, щоб вони піднялися 😊",
    "Ти мій затишок 🥰",
    "Сонечко, я від тебе хочу сина й донечку💕",
    "Ти моя пташка 💕",
    "hot as hell 💖",
    "Ти 10/10, по твоїй шкалі зі спартаком 😊",
    "У нас є кохання і трішечки віри 🥰",
    "Кажуть тиша - золото, але твої стогони дорожчі))💕",
    "Ти моя полуничка 🌞",
    "Люблю тебе в одязі і без 💖",
    "У тебе класні сильні руки 💖"
]

@app.route('/')
def home():
    return render_template('index.html')

@app.route('/message')
def get_message():
    return jsonify({'message': random.choice(messages)})

if __name__ == '__main__':
    app.run(debug=True, port=5000)